brew 'coreutils'
brew 'erlang@19'
brew 'exa'
brew 'fasd'
brew 'ffmpeg'
brew 'fortune'
brew 'git'
brew 'go'
brew 'jq'
brew 'lastpass-cli'
brew 'reattach-to-user-namespace'
brew 'tmux'
brew 'wget'
brew 'youtube-dl'
brew 'zsh'
brew 'zsh-autosuggestions'
brew 'zsh-history-substring-search'

cask_args appdir: '/Applications'
tap 'caskroom/cask'

# brew cask list
cask 'alfred'
cask 'fork'
cask 'istat-menus'
cask 'transmission'
cask 'karabiner-elements'
cask 'kap'
cask 'google-chrome'
cask 'meld'
cask 'steam'
cask 'sourcetree'
cask 'vlc'
cask 'visual-studio-code'

# Fonts
tap 'caskroom/fonts'
cask 'font-anonymous-pro'
cask 'font-noto-color-emoji'
cask 'font-noto-emoji'
cask 'font-noto-mono'
cask 'font-noto-sans'
cask 'font-noto-serif'
cask 'font-fira-code'
cask 'font-fira-mono'
cask 'font-fira-sans'
cask 'font-hack'
cask 'font-hasklig'
cask 'font-inconsolata'
cask 'font-source-code-pro'

