brew 'coreutils'
brew 'erlang@19'
brew 'exa'
brew 'fasd'
brew 'ffmpeg'
brew 'fortune'
brew 'git'
brew 'go'
brew 'jq'
brew 'lastpass-cli'
brew 'reattach-to-user-namespace'
brew 'tmux'
brew 'wget'
brew 'youtube-dl'
brew 'zsh'
brew 'zsh-autosuggestions'
brew 'zsh-history-substring-search'
brew 'rbenv'
brew 'vault'
brew 'pstree'
brew 'heroku/brew/heroku'

cask_args appdir: '/Applications'

# brew cask list
cask 'alfred' unless system 'test -e /Applications/Alfred\ 3.app'
cask 'beyond-compare' unless system 'test -e /Applications/Beyond Compare.app'
cask 'balenaetcher' unless system 'test -e /Applications/balenaEtcher.app'
cask 'gpg-suite' unless system 'test -e /Applications/GPG\ Keychain.app'
cask 'fork' unless system 'test -e /Applications/Fork.app'
cask 'istat-menus' unless system 'test -e /Applications/iStat\ Menus.app'
cask 'transmission' unless system 'test -e /Applications/Transmission.app'
cask 'karabiner-elements' unless system 'test -e /Applications/Karabiner-Elements.app'
cask 'kap' unless system 'test -e /Applications/Kap.app'
cask 'keybase' unless system 'test -e /Applications/Keybase.app'
cask 'google-chrome' unless system 'test -e /Applications/Google\ Chrome.app'
cask 'meld' unless system 'test -e /Applications/Meld.app'
cask 'steam' unless system 'test -e /Applications/Steam.app'
cask 'uhk-agent' unless system 'test -e /Applications/UHK\ Agent.app'
cask 'vlc' unless system 'test -e /Applications/VLC.app'
cask 'visual-studio-code' unless system 'test -e /Applications/Visual\ Studio\ Code.app'
cask 'spotfy' unless system 'test -e /Applications/Spotify.app'
cask 'signal' unless system 'test -e /Applications/Signal.app'
cask 'workflowy' unless system 'test -e /Applications/Workflowy.app'
cask 'ultimaker-cura' unless system 'test -e /Applications/Ultimaker Cura.app'
cask 'meshmixer' unless system 'test -e /Applications/Meshmixer.app'

# Fonts
tap 'caskroom/fonts'
cask 'font-anonymous-pro'
cask 'font-noto-color-emoji'
cask 'font-noto-emoji'
cask 'font-noto-mono'
cask 'font-noto-sans'
cask 'font-noto-serif'
cask 'font-fira-code'
cask 'font-fira-mono'
cask 'font-fira-sans'
cask 'font-hack'
cask 'font-hasklig'
cask 'font-inconsolata'
cask 'font-source-code-pro'

