brew 'coreutils'
brew 'erlang@19'
brew 'exa'
brew 'fasd'
brew 'ffmpeg'
brew 'fortune'
brew 'git'
brew 'go'
brew 'jq'
brew 'lastpass-cli'
brew 'reattach-to-user-namespace'
brew 'tmux'
brew 'wget'
brew 'youtube-dl'
brew 'zsh'
brew 'zsh-autosuggestions'
brew 'zsh-history-substring-search'

cask_args appdir: '/Applications'
tap 'caskroom/cask'

# brew cask list
cask 'alfred' unless system 'test -e /Applications/Alfred 3.app'
cask 'fork' unless system 'test -e /Applications/Fork.app'
cask 'istat-menus' unless system 'test -e /Applications/iStat Menus.app'
cask 'transmission' unless system 'test -e /Applications/Transmission.app'
cask 'karabiner-elements' unless system 'test -e /Applications/Karabiner-Elements.app'
cask 'kap' unless system 'test -e /Applications/Kap.app'
cask 'google-chrome' unless system 'test -e /Applications/Google Chrome.app'
cask 'meld' unless system 'test -e /Applications/Meld.app'
cask 'steam' unless system 'test -e /Applications/Steam.app'
cask 'sourcetree' unless system 'test -e /Applications/Sourcetree.app'
cask 'vlc' unless system 'test -e /Applications/VLC.app'
cask 'visual-studio-code' unless system 'test -e /Applications/Visual Studio Code.app'

# Fonts
tap 'caskroom/fonts'
cask 'font-anonymous-pro'
cask 'font-noto-color-emoji'
cask 'font-noto-emoji'
cask 'font-noto-mono'
cask 'font-noto-sans'
cask 'font-noto-serif'
cask 'font-fira-code'
cask 'font-fira-mono'
cask 'font-fira-sans'
cask 'font-hack'
cask 'font-hasklig'
cask 'font-inconsolata'
cask 'font-source-code-pro'

